xtee6/proxy/src/test/queries/centralservice-serviceid.query

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <sdsb:client id:objectType="MEMBER">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>consumer</id:memberCode>
        </sdsb:client>
        <sdsb:service id:objectType="CENTRALSERVICE">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:serviceCode>centralservice</id:serviceCode>
        </sdsb:service>
        <sdsb:service id:objectType="SERVICE">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>consumer</id:memberCode>
            <id:serviceCode>centralservice</id:serviceCode>
        </sdsb:service>
        <sdsb:userId>EE37702211234</sdsb:userId>
        <sdsb:id>1234567890</sdsb:id>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:centralservice xmlns:ns1="http://cosumer.ee.sdsb.net">
            <request>
                <name>foo</name>
                <age>35</age>
            </request>
        </ns1:centralservice>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
